app/views/groups/index.html.erb

SELECT "groups".* FROM "groups"
SELECT "users".* FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."group_id" = ?  [["group_id", 1]]
---
<% @groups.each do |group| %>
<%= group.group_name %>
<% group.users.each do |username|%>