app/controllers/groups_controller.rb

  def create
    @group = Group.create(group_params)
---
INSERT INTO "groups" ("group_name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["group_name", "123456"], ["user_id", "2"], ["created_at", "2016-02-24 23:03:10.285119"], ["updated_at", "2016-02-24 23:03:10.285119"]]

  def update
    #NOTE: any user can update any group in this setup. Maybe only authorize users to update groups they've created.
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", nil]]