app/controllers/pictures_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 9]]
INSERT INTO "pictures" ("url", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["url", "https://ucarecdn.com/692d5267-0adc-48c4-83ab-217a0a83c32c/"], ["group_id", 9], ["created_at", "2016-02-26 04:33:28.213230"], ["updated_at", "2016-02-26 04:33:28.213230"]]
---
  def addPictureToGroup
    @group = Group.find(params[:id])
    @picture = @group.pictures.new(picture_params)
    if @picture.save