app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "1245662432"], ["email", "123456@gmail.com"], ["password_digest", "askdfjhlsjf"], ["created_at", "2016-02-23 04:54:47.728240"], ["updated_at", "2016-02-23 04:54:47.728240"]]
---
  def create #creating user
    @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 8]]
---
  def show
    # redirect to this after logging in and also signing up
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    # grabbing data for update method
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "123"], ["updated_at", "2016-02-23 04:48:02.724087"], ["id", 2]]
---
  def update
    # update user profile
    @user = User.find(params[:id])
    @user.update_attributes(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    #destroys user from database
    @user = User.find(params[:id])
    @user.destroy